jitingcn/Adafruit_nRF52_Bootloader/lib/sdk11/components/libraries/bootloader_dfu/bootloader.c
/* Copyright (c) 2013 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is property of Nordic Semiconductor ASA.
 * Terms and conditions of usage are described in detail in NORDIC
 * SEMICONDUCTOR STANDARD SOFTWARE LICENSE AGREEMENT.
 *
 * Licensees are granted free, non-transferable use of the information. NO
 * WARRANTY of ANY KIND is provided. This heading must NOT be removed from
 * the file.
 *
 */

#include "sdk_common.h"
#include "bootloader.h"
#include "bootloader_types.h"
#include "bootloader_util.h"
#include "bootloader_settings.h"
#include "dfu.h"
#include "dfu_transport.h"
#include "nrf.h"
#include "app_error.h"
#include "nrf_sdm.h"
#include "nrf_mbr.h"
#include "nordic_common.h"
#include "crc16.h"
#include "pstorage.h"
#include "app_scheduler.h"

#include "nrfx.h"
#include "nrf_wdt.h"
#include "app_timer.h"

#include "boards.h"

#ifdef NRF_USBD
#include "tusb.h"
#include "uf2/uf2.h"
#endif

/**@brief Enumeration for specifying current bootloader status.
 */
typedef enum
{
    BOOTLOADER_UPDATING,                                /**< Bootloader status for indicating that an update is in progress. */
    BOOTLOADER_SETTINGS_SAVING,                         /**< Bootloader status for indicating that saving of bootloader settings is in progress. */
    BOOTLOADER_COMPLETE,                                /**< Bootloader status for indicating that all operations for the update procedure has completed and it is safe to reset the system. */
    BOOTLOADER_TIMEOUT,                                 /**< Bootloader status field for indicating that a timeout has occured and current update process should be aborted. */
    BOOTLOADER_SYS_RESET,                               /**< Bootloader status field for indicating that a reset has been requested and current update process should be aborted. */
    BOOTLOADER_RESET_TO_SELF,                           /**< Bootloader status field for indicating that a reset has been requested and current update process should be aborted and the bootloader must be reentered. */
} bootloader_status_t;

static pstorage_handle_t        m_bootsettings_handle;  /**< Pstorage handle to use for registration and identifying the bootloader module on subsequent calls to the pstorage module for load and store of bootloader setting in flash. */
static bootloader_status_t      m_update_status;        /**< Current update status for the bootloader module to ensure correct behaviour when updating settings and when update completes. */
static bool m_cancel_timeout_on_usb; /**< If set the timeout is cancelled when USB is enumerated. Otherwise, the timeout is only cancelled when DFU update is started. */
static bool m_usb_was_mounted; /**< Tracks whether the USB DFU session was ever enumerated so we can exit when cable is later removed. */
static bool m_startup_dfu_has_activity; /**< Tracks whether any valid serial or UF2 update traffic has started. */

APP_TIMER_DEF( _dfu_startup_timer );

static void bootloader_timeout_startup_dfu(void)
{
    // Never leave DFU while a UF2 image is only partially written.
#ifdef NRF_USBD
    if (uf2_is_transfer_incomplete())
    {
        return;
    }
#endif

    if (!m_startup_dfu_has_activity)
    {
        dfu_update_status_t update_status;
        update_status.status_code = DFU_TIMEOUT;

        bootloader_dfu_update_process(update_status);
    }
}

void bootloader_dfu_activity_mark(void)
{
    m_startup_dfu_has_activity = true;
}

void bootloader_mark_usb_mounted(void)
{
    m_usb_was_mounted = true;
}

/**@brief   Function for handling callbacks from pstorage module.
 *
 * @details Handles pstorage results for clear and storage operation. For detailed description of
 *          the parameters provided with the callback, please refer to \ref pstorage_ntf_cb_t.
 */
static void pstorage_callback_handler(pstorage_handle_t * p_handle,
                                      uint8_t             op_code,
                                      uint32_t            result,
                                      uint8_t           * p_data,
                                      uint32_t            data_len)
{
    // If we are in BOOTLOADER_SETTINGS_SAVING state and we receive an PSTORAGE_STORE_OP_CODE
    // response then settings has been saved and update has completed.
    if ((m_update_status == BOOTLOADER_SETTINGS_SAVING) && (op_code == PSTORAGE_STORE_OP_CODE))
    {
        m_update_status = BOOTLOADER_COMPLETE;
    }

    APP_ERROR_CHECK(result);
}

/* Terminate the forced DFU mode on startup if no packets is received
 * by put an terminal handler to scheduler
 */
static void dfu_startup_timer_handler(void * p_context)
{
#ifdef NRF_USBD
  // If host enumerated the device, keep waiting — m_usb_was_mounted was set
  // by tud_mount_cb() and the unplug path in wait_for_events() will handle exit.
  if (m_cancel_timeout_on_usb && m_usb_was_mounted)
  {
    return;
  }
#endif

  // nRF52832 forced DFU on startup
  // No update activity is received within timeout, exit DFU mode
  bootloader_timeout_startup_dfu();
}

/**@brief   Function for waiting for events.
 *
 * @details This function will place the chip in low power mode while waiting for events from
 *          the SoftDevice or other peripherals. When interrupted by an event, it will call the
 *          @ref app_sched_execute function to process the received event. This function will return
 *          when the final state of the firmware update is reached OR when a tear down is in
 *          progress.
 */

bool bootloader_app_is_valid(void);

#if defined(BUTTON_DFU_OTA)
// Button state tracking for double-press detection
static uint32_t last_button_edge_time = 0;         // for debounce / edge filtering
static uint32_t last_button_press_time = 0;        // for double-press window
static bool     have_last_button_press_time = false;
static bool     button_was_pressed = false;
#endif

static void wait_for_events(void)
{
  for ( ;; )
  {
    // Wait in low power state for any events.
//    uint32_t err_code = sd_app_evt_wait();
//    APP_ERROR_CHECK(err_code);

    // Feed all Watchdog just in case application enable it
    // WDT cannot be disabled once started. It even last through NVIC soft reset
    if ( nrf_wdt_started(NRF_WDT) )
    {
      for (uint8_t i=0; i<8; i++) nrf_wdt_reload_request_set(NRF_WDT, i);
    }

    // Event received. Process it from the scheduler.
    app_sched_execute();

#ifdef NRF_USBD
    // skip if usb is not inited ( e.g OTA / finializing sd/bootloader )
    if ( tusb_inited() )
    {
      tud_task();
      tud_cdc_write_flush();
    }

    // Exit startup DFU once USB was actually unplugged (VBUS gone), not on a
    // host-side re-enumeration or temporary unmount.
    if (m_cancel_timeout_on_usb && m_usb_was_mounted &&
        !(NRF_POWER->USBREGSTATUS & POWER_USBREGSTATUS_VBUSDETECT_Msk))
    {
      bootloader_timeout_startup_dfu();
    }
#endif

#if defined(BUTTON_DFU_OTA)
    // Check for BUTTON_DFU_OTA (BUTTON_2) double-press to exit DFU mode.
    // This allows users to exit DFU mode without flashing firmware.
    // Only allow exit when USB VBUS is NOT present (to prevent accidental exit during flashing).

    // Window definitions (in app_timer ticks)
    enum
    {
      DFU_EXIT_DOUBLE_PRESS_WINDOW_TICKS = APP_TIMER_TICKS(500),
      DFU_EXIT_DEBOUNCE_TICKS            = APP_TIMER_TICKS(50),
    };

#ifdef NRF_USBD
    // Check if USB VBUS is physically connected.
    uint32_t usb_reg = NRF_POWER->USBREGSTATUS;
    bool vbus_present = (usb_reg & POWER_USBREGSTATUS_VBUSDETECT_Msk) != 0;

    // Only allow button exit when USB is NOT connected.
    if (!vbus_present)
#endif
    {
      bool button_current = button_pressed(BUTTON_DFU_OTA);

      // Detect button press (transition from not pressed to pressed)
      if (button_current && !button_was_pressed)
      {
        uint32_t current_time = app_timer_cnt_get();

        // Debounce: ignore edges that occur too close together.
        uint32_t edge_diff = app_timer_cnt_diff_compute(current_time, last_button_edge_time);

        if (edge_diff >= DFU_EXIT_DEBOUNCE_TICKS)
        {
          // Accepted edge.
          last_button_edge_time = current_time;

          // Only treat it as a double press if we have a previous press time.
          if (have_last_button_press_time)
          {
            uint32_t time_diff = app_timer_cnt_diff_compute(current_time, last_button_press_time);

            if (time_diff < DFU_EXIT_DOUBLE_PRESS_WINDOW_TICKS)
            {
              // Double-press detected: only exit DFU if there is a valid application
              // to boot and no incomplete UF2 transfer in progress.
              if (bootloader_app_is_valid()
#ifdef NRF_USBD
                  && !uf2_is_transfer_incomplete()
#endif
                 )
              {
                m_update_status = BOOTLOADER_TIMEOUT;
              }
            }
          }

          last_button_press_time = current_time;
          have_last_button_press_time = true;
        }
      }

      button_was_pressed = button_current;
    }
#endif

    if ((m_update_status == BOOTLOADER_COMPLETE) ||
        (m_update_status == BOOTLOADER_TIMEOUT) ||
        (m_update_status == BOOTLOADER_SYS_RESET) ||
        (m_update_status == BOOTLOADER_RESET_TO_SELF))
    {
      // When update has completed or a timeout/reset occurred we will return.
      return;
    }
  }
}


bool bootloader_app_is_valid(void)
{
  uint32_t const app_addr = DFU_BANK_0_REGION_START;
  uint32_t const sp_addr = *((uint32_t*)app_addr);
  uint32_t const reset_addr = *((uint32_t*)(app_addr + 4));

  enum { EMPTY_FLASH = 0xFFFFFFFFUL };

  if (sp_addr == EMPTY_FLASH && reset_addr == EMPTY_FLASH)
  {
    return false;
  }

  bootloader_settings_t const * p_bootloader_settings;
  bootloader_util_settings_get(&p_bootloader_settings);

  // Primary path: a prior DFU flagged bank 0 as valid.
  if (p_bootloader_settings->bank_0 == BANK_VALID_APP)
  {
    uint16_t image_crc = 0;

    // A stored crc value of 0 indicates that CRC checking is not used.
    if ( p_bootloader_settings->bank_0_crc != 0 )
    {
      image_crc = crc16_compute((uint8_t*) app_addr,
                                p_bootloader_settings->bank_0_size,
                                NULL);
    }

    return (image_crc == p_bootloader_settings->bank_0_crc);
  }

  // Fallback for debugger-flashed apps: settings page is erased (bank_0 = 0xFFFF)
  // but an app may still have been written to bank 0 directly. Accept it if its
  // Cortex-M vector table is plausible: initial SP within RAM, reset vector
  // within app flash region with the Thumb bit set. The SP upper bound is
  // inclusive because the empty-descending stack initializes one past RAM end.
  if (p_bootloader_settings->bank_0 == 0xFFFF)
  {
    uint32_t const ram_start = 0x20000000UL;
    uint32_t const ram_end = ram_start + (NRF_FICR->INFO.RAM << 10u);
    bool const sp_valid = (sp_addr >= ram_start) && (sp_addr <= ram_end) && ((sp_addr & 3U) == 0);
    bool const reset_in_app = (reset_addr & 1U) &&
      (reset_addr >= app_addr) &&
      (reset_addr < BOOTLOADER_REGION_START);
    return sp_valid && reset_in_app;
  }

  return false;
}


static void bootloader_settings_save(bootloader_settings_t * p_settings)
{
  if ( is_ota() )
  {
    uint32_t err_code;
    while(1) {
      err_code = pstorage_clear(&m_bootsettings_handle, sizeof(bootloader_settings_t));
      if (err_code != NRF_ERROR_NO_MEM) {
        break;
      }
      // This means the write/erase queue of commands was completely full - Should not
      //  happen, but better safe than sorry, wait until space becomes available -
      //  the pstorage event handler is only run from the main loop, and we are also
      //  running from a BLE event on the main loop: This means if we wait here, the FLASH
      //  completion events will never be handled (will be queued by app_scheduler, but
      //  not handled, and that means this wait will never end... So, process SOC events
      //  from the SD (but NOT BLE events!) - This will free entries on the pstorage queue
      //  as soon as operations are complete, allowing this op to be queued
      while (NRF_ERROR_NOT_FOUND != proc_soc()) {
        // nothing
      }
    }
    APP_ERROR_CHECK(err_code);

    while(1) {
      err_code = pstorage_store(&m_bootsettings_handle, (uint8_t *) p_settings, sizeof(bootloader_settings_t), 0);
      if (err_code != NRF_ERROR_NO_MEM) {
        break;
      }
      // No space, wait until an entry in the queue is freed
      while (NRF_ERROR_NOT_FOUND != proc_soc()) {
        // nothing
      }
    }
    APP_ERROR_CHECK(err_code);
  }
  else
  {
    nrfx_nvmc_page_erase(BOOTLOADER_SETTINGS_ADDRESS);
    nrfx_nvmc_words_write(BOOTLOADER_SETTINGS_ADDRESS, (uint32_t *) p_settings, sizeof(bootloader_settings_t) / 4);

    pstorage_callback_handler(&m_bootsettings_handle, PSTORAGE_STORE_OP_CODE, NRF_SUCCESS, (uint8_t *) p_settings, sizeof(bootloader_settings_t));
  }
}


void bootloader_dfu_update_process(dfu_update_status_t update_status)
{
  __attribute__((aligned(4)))  static bootloader_settings_t settings;
  bootloader_settings_t const * p_bootloader_settings;

  bootloader_util_settings_get(&p_bootloader_settings);

  if (update_status.status_code == DFU_UPDATE_APP_COMPLETE)
  {
    settings.bank_0_crc  = update_status.app_crc;
    settings.bank_0_size = update_status.app_size;
    settings.bank_0      = BANK_VALID_APP;
    settings.bank_1      = BANK_INVALID_APP;

    m_update_status      = BOOTLOADER_SETTINGS_SAVING;
    bootloader_settings_save(&settings);
  }
  else if (update_status.status_code == DFU_UPDATE_SD_COMPLETE)
  {
    settings.bank_0_crc     = update_status.app_crc;
    settings.bank_0_size    = update_status.sd_size + update_status.bl_size + update_status.app_size;
    settings.bank_0         = BANK_VALID_SD;
    settings.bank_1         = BANK_INVALID_APP;
    settings.sd_image_size  = update_status.sd_size;
    settings.bl_image_size  = update_status.bl_size;
    settings.app_image_size = update_status.app_size;
    settings.sd_image_start = update_status.sd_image_start;

    m_update_status         = BOOTLOADER_SETTINGS_SAVING;
    bootloader_settings_save(&settings);
  }
  else if (update_status.status_code == DFU_UPDATE_BOOT_COMPLETE)
  {
    settings.bank_0         = p_bootloader_settings->bank_0;
    settings.bank_0_crc     = p_bootloader_settings->bank_0_crc;
    settings.bank_0_size    = p_bootloader_settings->bank_0_size;
    settings.bank_1         = BANK_VALID_BOOT;
    settings.sd_image_size  = update_status.sd_size;
    settings.bl_image_size  = update_status.bl_size;
    settings.app_image_size = update_status.app_size;

    m_update_status         = BOOTLOADER_SETTINGS_SAVING;
    bootloader_settings_save(&settings);
  }
  else if (update_status.status_code == DFU_UPDATE_SD_SWAPPED)
  {
    if (p_bootloader_settings->bank_0 == BANK_VALID_SD)
    {
      settings.bank_0_crc     = 0;
      settings.bank_0_size    = 0;
      settings.bank_0         = BANK_INVALID_APP;
    }
    // This handles cases where SoftDevice was not updated, hence bank0 keeps its settings.
    else
    {
      settings.bank_0         = p_bootloader_settings->bank_0;
      settings.bank_0_crc     = p_bootloader_settings->bank_0_crc;
      settings.bank_0_size    = p_bootloader_settings->bank_0_size;
    }

    settings.bank_1         = BANK_INVALID_APP;
    settings.sd_image_size  = 0;
    settings.bl_image_size  = 0;
    settings.app_image_size = 0;

    m_update_status         = BOOTLOADER_SETTINGS_SAVING;
    bootloader_settings_save(&settings);
  }
  else if (update_status.status_code == DFU_TIMEOUT)
  {
    // Timeout has occurred. Close the connection with the DFU Controller.
    uint32_t err_code;
    if ( is_ota() )
    {
      err_code = dfu_transport_ble_close();
    }else
    {
      err_code = dfu_transport_serial_close();
    }
    APP_ERROR_CHECK(err_code);

    m_update_status = BOOTLOADER_TIMEOUT;
  }
  else if (update_status.status_code == DFU_BANK_0_ERASED)
  {
    settings.bank_0_crc  = 0;
    settings.bank_0_size = 0;
    settings.bank_0      = BANK_INVALID_APP;
    settings.bank_1      = p_bootloader_settings->bank_1;

    bootloader_settings_save(&settings);
  }
  else if (update_status.status_code == DFU_RESET)
  {
    m_update_status =
      (update_status.restart_into_bootloader == false ? BOOTLOADER_SYS_RESET : BOOTLOADER_RESET_TO_SELF);
  }
  else
  {
    // No implementation needed.
  }
}

bool bootloader_must_reset_to_self(void)
{
  return m_update_status == BOOTLOADER_RESET_TO_SELF;
}

uint32_t bootloader_init(void)
{
  uint32_t                err_code;
  pstorage_module_param_t storage_params = {.cb = pstorage_callback_handler};

  err_code = pstorage_init();
  VERIFY_SUCCESS(err_code);

  m_bootsettings_handle.block_id = BOOTLOADER_SETTINGS_ADDRESS;
  err_code = pstorage_register(&storage_params, &m_bootsettings_handle);

  return err_code;
}


uint32_t bootloader_dfu_start(bool ota, uint32_t timeout_ms, bool cancel_timeout_on_usb)
{
  uint32_t err_code;

  m_cancel_timeout_on_usb = cancel_timeout_on_usb && !ota;
  m_usb_was_mounted = false;
  m_startup_dfu_has_activity = false;

  // Clear swap if banked update is used.
  err_code = dfu_init();
  VERIFY_SUCCESS(err_code);

  if ( ota )
  {
    err_code = dfu_transport_ble_update_start();
  }else
  {
    // DFU mode with timeout can be
    // - Forced startup DFU for nRF52832 or
    // - Makecode single tap reset but no enumerated (battery power)
    if ( timeout_ms )
    {
      app_timer_create(&_dfu_startup_timer, APP_TIMER_MODE_SINGLE_SHOT, dfu_startup_timer_handler);
      app_timer_start(_dfu_startup_timer, APP_TIMER_TICKS(timeout_ms), NULL);
    }

    err_code = dfu_transport_serial_update_start();
  }

  wait_for_events();

  return err_code;
}

void bootloader_app_start(void)
{
  // Disable all interrupts
  NVIC->ICER[0]=0xFFFFFFFF;
  NVIC->ICPR[0]=0xFFFFFFFF;
#if defined(__NRF_NVIC_ISER_COUNT) && __NRF_NVIC_ISER_COUNT == 2
  NVIC->ICER[1]=0xFFFFFFFF;
  NVIC->ICPR[1]=0xFFFFFFFF;
#endif

  uint32_t fwd_ret;
  uint32_t app_addr;

  if ( is_sd_existed() )
  {
    PRINTF("SoftDevice exist\r\n");
    // App starts after SoftDevice
    app_addr = SD_SIZE_GET(MBR_SIZE);
    fwd_ret = sd_softdevice_vector_table_base_set(app_addr);
  }else
  {
    PRINTF("SoftDevice not exist\r\n");

    // App starts right after MBR
    app_addr = MBR_SIZE;
    sd_mbr_command_t command =
    {
      .command = SD_MBR_COMMAND_IRQ_FORWARD_ADDRESS_SET,
      .params.irq_forward_address_set.address = app_addr,
    };

    fwd_ret = sd_mbr_command(&command);
  }

  // unlikely failed to forward vector table, manually set forward address
  if ( fwd_ret != NRF_SUCCESS )
  {
    PRINT_HEX(fwd_ret);

    // MBR use first 4-bytes of SRAM to store foward address
    *(uint32_t *)(0x20000000) = app_addr;
  }

  // jump to app
  bootloader_util_app_start(app_addr);
}


bool bootloader_dfu_sd_in_progress(void)
{
  bootloader_settings_t const * p_bootloader_settings;

  bootloader_util_settings_get(&p_bootloader_settings);

  if (p_bootloader_settings->bank_0 == BANK_VALID_SD ||
      p_bootloader_settings->bank_1 == BANK_VALID_BOOT)
  {
    return true;
  }

  return false;
}


uint32_t bootloader_dfu_sd_update_continue(void)
{
  uint32_t err_code;

  if ((dfu_sd_image_validate() == NRF_SUCCESS) &&
      (dfu_bl_image_validate() == NRF_SUCCESS))
  {
      return NRF_SUCCESS;
  }

  // Ensure that flash operations are not executed within the first 100 ms seconds to allow
  // a debugger to be attached.
  NRFX_DELAY_MS(100);

  err_code = dfu_sd_image_swap();
  APP_ERROR_CHECK(err_code);

  err_code = dfu_sd_image_validate();
  APP_ERROR_CHECK(err_code);

  err_code = dfu_bl_image_swap();
  APP_ERROR_CHECK(err_code);

  return err_code;
}


uint32_t bootloader_dfu_sd_update_finalize(void)
{
  dfu_update_status_t update_status = { 0 };
  update_status.status_code = DFU_UPDATE_SD_SWAPPED;

  bootloader_dfu_update_process(update_status);

  wait_for_events();

  return NRF_SUCCESS;
}


void bootloader_settings_get(bootloader_settings_t * const p_settings)
{
  bootloader_settings_t const * p_bootloader_settings;

  bootloader_util_settings_get(&p_bootloader_settings);

  p_settings->bank_0         = p_bootloader_settings->bank_0;
  p_settings->bank_0_crc     = p_bootloader_settings->bank_0_crc;
  p_settings->bank_0_size    = p_bootloader_settings->bank_0_size;
  p_settings->bank_1         = p_bootloader_settings->bank_1;
  p_settings->sd_image_size  = p_bootloader_settings->sd_image_size;
  p_settings->bl_image_size  = p_bootloader_settings->bl_image_size;
  p_settings->app_image_size = p_bootloader_settings->app_image_size;
  p_settings->sd_image_start = p_bootloader_settings->sd_image_start;
}
